# UIThemeManager Members (2023)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2023 API
---
UIThemeManager Members
UIThemeManager Class Methods Properties See Also
---
The UIThemeManager type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetThemeName | Gets the theme name for the given theme type. |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| CurrentTheme | The current theme. |
| DefaultTheme | The default theme. |

# See Also
UIThemeManager Class
Autodesk.Revit.UI Namespace